In [4]:
import pandas as pd
import numpy as np

data = pd.DataFrame({'first_name':     ['Jason',             'Molly',                'Tina',      'Jake',                'Amy'], 
                     'last_name':      ['Miller',            'Jacobson',             'Ali',       'Miner',               'Cooze'], 
                     'email':          ['jas203@gmail.com',  'momomolly@gmail.com',   np.nan,        'battler@milner.com',   'Ames1234@yahoo.com'],  
                     'preTestScore':   [4,                   24,                      31,          2,                     3],
                     'postTestScore':  [25,                  94,                      57,          62,                    70],
                     })
data

                 email first_name last_name  postTestScore  preTestScore
0     jas203@gmail.com      Jason    Miller             25             4
1  momomolly@gmail.com      Molly  Jacobson             94            24
2                  NaN       Tina       Ali             57            31
3   battler@milner.com       Jake     Miner             62             2
4   Ames1234@yahoo.com        Amy     Cooze             70             3

In [6]:
data1 = data.reindex(columns=['first_name','last_name','email','preTestScore','postTestScore'])
data1

  first_name last_name                email  preTestScore  postTestScore
0      Jason    Miller     jas203@gmail.com             4             25
1      Molly  Jacobson  momomolly@gmail.com            24             94
2       Tina       Ali                  NaN            31             57
3       Jake     Miner   battler@milner.com             2             62
4        Amy     Cooze   Ames1234@yahoo.com             3             70

In [7]:
data = {'Jason Miller' :'jas203@gmail.com', 'Molly Jacobson':'momomolly@gmail.com', 
       'Tina Ali': np.nan,'Jake Miner':'battler@milner.com','Amy Cooze': 'Ames1234@yahoo.com'}
data = pd.Series(data)
data

Amy Cooze          Ames1234@yahoo.com
Jake Miner         battler@milner.com
Jason Miller         jas203@gmail.com
Molly Jacobson    momomolly@gmail.com
Tina Ali                          NaN
dtype: object

In [8]:
data.isnull()

Amy Cooze         False
Jake Miner        False
Jason Miller      False
Molly Jacobson    False
Tina Ali           True
dtype: bool

In [9]:
data.str.contains('gmail')

Amy Cooze         False
Jake Miner        False
Jason Miller       True
Molly Jacobson     True
Tina Ali            NaN
dtype: object

In [15]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+\\.([A-Z]{2,4})'

In [17]:
import re
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'
data.str.findall(pattern, flags=re.IGNORECASE)

Amy Cooze          [(Ames1234, yahoo, com)]
Jake Miner         [(battler, milner, com)]
Jason Miller         [(jas203, gmail, com)]
Molly Jacobson    [(momomolly, gmail, com)]
Tina Ali                                NaN
dtype: object